Changes in [1a42251](https://github.com/entur/terraform/pull/13/commits/1a422517724c9f587e8c0c244d90105f0c202aae):

* default convention is: app-namespace-rand
* can be overridden with variable db_instance_custom_name
* other options removed

**Plan output:**

**Default:**
 module.postgres.module.sql-db_postgresql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)

[...]

module.postgres.module.sql-db_postgresql.google_sql_database_instance.default: Creation complete after 3m44s [id=redacted-env-3128]

**Override set to "foo":**
db_instance_custom_name = "foo" 
 module.postgres.module.sql-db_postgresql.google_sql_database_instance.default will be created
  + resource "google_sql_database_instance" "default" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "foo"
